/* 
Значение в си бывают переменными и константами/литералами. 
Имена переменных должны быть существенными, т.е. обозначать объекты (например, int age; - возраст, float weight; - вес и т.д.).
Си различает регистр букв в именах переменных, т.е. age и Age - это разные переменные.
В переменных можно использовать только символы латинского алфавита, цифры и знак подчеркивания (_).
Типы данных в си бывают знаковыми (signed) и беззнаковыми (unsigned).
так же делят по размеру на короткие (short), обычные (int) и длинные (long). Так же char
Есть еще вещественные типы float, double и long double, но они не относятся к целочисленным типам.
signed - это тип данных, который может хранить как положительные, так и отрицательные значения. [-128 до 127 для char, 
-32,768 до 32,767 для short, -2,147,483,648 до 2,147,483,647 для int]
unsigned - это тип данных, который может хранить только положительные значения и ноль. [0 до 255 для char, 
0 до 65,535 для short, 0 до 4,294,967,295 для int]
*/